Autodesk.Revit.DB.Rectangle.IsNormalized
Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom.
Since:
2014

Autodesk.Revit.DB.Rectangle.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Rectangle.Bottom
The y-coordinate of the bottom-right corner of the rectangle.
Since:
2014

Autodesk.Revit.DB.Rectangle.Right
The x-coordinate of the bottom-right corner of the rectangle.
Since:
2014

Autodesk.Revit.DB.Rectangle.Top
The y-coordinate of the top-left corner of the rectangle.
Since:
2014

Autodesk.Revit.DB.Rectangle.Left
The x-coordinate of the top-left corner of the rectangle.
Since:
2014

Autodesk.Revit.DB.Rectangle.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Creates an Rectangle instance with the specified four integers
that represent the left, top, right and bottom of a rectangle.
left:
The x-coordinate of the top-left corner.
top:
The y-coordinate of the top-left corner.
right:
The x-coordinate of the bottom-right corner.
bottom:
The y-coordinate of the bottom-right corner.
Since:
2014

Autodesk.Revit.DB.Rectangle.#ctor
Create an empty Rectangle instance with values (0,0,0,0).
Since:
2014

Autodesk.Revit.DB.Rectangle.#ctor(Autodesk.Revit.DB.Rectangle)
Constructs a new copy of the input ScreenRectangle object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Rectangle
Stores a set of four integers that represent the left, top, right and bottom of a rectangle.
Remarks:
It usually represents a rectangle on the screen. Left must be less than right and top must be less than bottom.
Since:
2014